Table of Contents
 Class CoordSystemByVector
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Coordinate system defined by vectors
[OpenModelClass("CI.Geometry3D.CoordSystemByVector,CI.Geometry3D")]
public class CoordSystemByVector : CoordSystem
Inheritance
object
OpenObject
CoordSystem
CoordSystemByVector
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 VecX
Axis X unit vector
public Vector3D VecX { get; set; }
Property Value
Vector3D
 VecY
Axis Y unit vector
public Vector3D VecY { get; set; }
Property Value
Vector3D
 VecZ
Axis Z unit vector
public Vector3D VecZ { get; set; }
Property Value
Vector3D
 Edit this page